cases/case1/constant/polyMesh/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\ 
| =========                 |                                             | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       | 
|  \\    /   O peration     | Version:  2.4.0                             | 
|   \\  /    A nd           | Web:      www.openfoam.com                  | 
|    \\/     M anipulation  |                                             | 
\*-----------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 

vertices
(
    (     -25     -0.5        0)
    (      25     -0.5        0)
    (      25      0.5        0)
    (     -25      0.5        0)
    (     -25     -0.5        5)
    (      25     -0.5        5)
    (      25      0.5        5)
    (     -25      0.5        5)
    (     -25     -0.5      500)
    (      25     -0.5      500)
    (      25      0.5      500)
    (     -25      0.5      500)
);

edges
(
    spline 0 1 (
        ( -25.000000	-0.500000	0.000000 )
        ( -24.950000	-0.500000	0.000000 )
        ( -24.900000	-0.500000	0.000000 )
        ( -24.850000	-0.500000	0.000000 )
        ( -24.800000	-0.500000	0.000000 )
        ( -24.750000	-0.500000	0.000000 )
        ( -24.700000	-0.500000	0.000000 )
        ( -24.650000	-0.500000	0.000000 )
        ( -24.600000	-0.500000	0.000000 )
        ( -24.550000	-0.500000	0.000000 )
        ( -24.500000	-0.500000	0.000000 )
        ( -24.450000	-0.500000	0.000000 )
        ( -24.400000	-0.500000	0.000000 )
        ( -24.350000	-0.500000	0.000000 )
        ( -24.300000	-0.500000	0.000000 )
        ( -24.250000	-0.500000	0.000000 )
        ( -24.200000	-0.500000	0.000000 )
        ( -24.150000	-0.500000	0.000000 )
        ( -24.100000	-0.500000	0.000000 )
        ( -24.050000	-0.500000	0.000000 )
        ( -24.000000	-0.500000	0.000000 )
        ( -23.950000	-0.500000	0.000000 )
        ( -23.900000	-0.500000	0.000000 )
        ( -23.850000	-0.500000	0.000000 )
        ( -23.800000	-0.500000	0.000000 )
        ( -23.750000	-0.500000	0.000000 )
        ( -23.700000	-0.500000	0.000000 )
        ( -23.650000	-0.500000	0.000000 )
        ( -23.600000	-0.500000	0.000000 )
        ( -23.550000	-0.500000	0.000000 )
        ( -23.500000	-0.500000	0.000000 )
        ( -23.450000	-0.500000	0.000000 )
        ( -23.400000	-0.500000	0.000000 )
        ( -23.350000	-0.500000	0.000000 )
        ( -23.300000	-0.500000	0.000000 )
        ( -23.250000	-0.500000	0.000000 )
        ( -23.200000	-0.500000	0.000000 )
        ( -23.150000	-0.500000	0.000000 )
        ( -23.100000	-0.500000	0.000000 )
        ( -23.050000	-0.500000	0.000000 )
        ( -23.000000	-0.500000	0.000000 )
        ( -22.950000	-0.500000	0.000000 )
        ( -22.900000	-0.500000	0.000000 )
        ( -22.850000	-0.500000	0.000000 )
        ( -22.800000	-0.500000	0.000000 )
        ( -22.750000	-0.500000	0.000000 )
        ( -22.700000	-0.500000	0.000000 )
        ( -22.650000	-0.500000	0.000000 )
        ( -22.600000	-0.500000	0.000000 )
        ( -22.550000	-0.500000	0.000000 )
        ( -22.500000	-0.500000	0.000000 )
        ( -22.450000	-0.500000	0.000000 )
        ( -22.400000	-0.500000	0.000000 )
        ( -22.350000	-0.500000	0.000000 )
        ( -22.300000	-0.500000	0.000000 )
        ( -22.250000	-0.500000	0.000000 )
        ( -22.200000	-0.500000	0.000000 )
        ( -22.150000	-0.500000	0.000000 )
        ( -22.100000	-0.500000	0.000000 )
        ( -22.050000	-0.500000	0.000000 )
        ( -22.000000	-0.500000	0.000000 )
        ( -21.950000	-0.500000	0.000000 )
        ( -21.900000	-0.500000	0.000000 )
        ( -21.850000	-0.500000	0.000000 )
        ( -21.800000	-0.500000	0.000000 )
        ( -21.750000	-0.500000	0.000000 )
        ( -21.700000	-0.500000	0.000000 )
        ( -21.650000	-0.500000	0.000000 )
        ( -21.600000	-0.500000	0.000000 )
        ( -21.550000	-0.500000	0.000000 )
        ( -21.500000	-0.500000	0.000000 )
        ( -21.450000	-0.500000	0.000000 )
        ( -21.400000	-0.500000	0.000000 )
        ( -21.350000	-0.500000	0.000000 )
        ( -21.300000	-0.500000	0.000000 )
        ( -21.250000	-0.500000	0.000000 )
        ( -21.200000	-0.500000	0.000000 )
        ( -21.150000	-0.500000	0.000000 )
        ( -21.100000	-0.500000	0.000000 )
        ( -21.050000	-0.500000	0.000000 )
        ( -21.000000	-0.500000	0.000000 )
        ( -20.950000	-0.500000	0.000000 )
        ( -20.900000	-0.500000	0.000000 )
        ( -20.850000	-0.500000	0.000000 )
        ( -20.800000	-0.500000	0.000000 )
        ( -20.750000	-0.500000	0.000000 )
        ( -20.700000	-0.500000	0.000000 )
        ( -20.650000	-0.500000	0.000000 )
        ( -20.600000	-0.500000	0.000000 )
        ( -20.550000	-0.500000	0.000000 )
        ( -20.500000	-0.500000	0.000000 )
        ( -20.450000	-0.500000	0.000000 )
        ( -20.400000	-0.500000	0.000000 )
        ( -20.350000	-0.500000	0.000000 )
        ( -20.300000	-0.500000	0.000000 )
        ( -20.250000	-0.500000	0.000000 )
        ( -20.200000	-0.500000	0.000000 )
        ( -20.150000	-0.500000	0.000000 )
        ( -20.100000	-0.500000	0.000000 )
        ( -20.050000	-0.500000	0.000000 )
...
    )
    spline 3 2 (
        ( -25.000000	0.500000	0.000000 )
        ( -24.950000	0.500000	0.000000 )
        ( -24.900000	0.500000	0.000000 )
        ( -24.850000	0.500000	0.000000 )
        ( -24.800000	0.500000	0.000000 )
        ( -24.750000	0.500000	0.000000 )
        ( -24.700000	0.500000	0.000000 )
        ( -24.650000	0.500000	0.000000 )
        ( -24.600000	0.500000	0.000000 )
        ( -24.550000	0.500000	0.000000 )
        ( -24.500000	0.500000	0.000000 )
        ( -24.450000	0.500000	0.000000 )
        ( -24.400000	0.500000	0.000000 )
        ( -24.350000	0.500000	0.000000 )
        ( -24.300000	0.500000	0.000000 )
        ( -24.250000	0.500000	0.000000 )
        ( -24.200000	0.500000	0.000000 )
        ( -24.150000	0.500000	0.000000 )
        ( -24.100000	0.500000	0.000000 )
        ( -24.050000	0.500000	0.000000 )
        ( -24.000000	0.500000	0.000000 )
        ( -23.950000	0.500000	0.000000 )
        ( -23.900000	0.500000	0.000000 )
        ( -23.850000	0.500000	0.000000 )
        ( -23.800000	0.500000	0.000000 )
        ( -23.750000	0.500000	0.000000 )
        ( -23.700000	0.500000	0.000000 )
        ( -23.650000	0.500000	0.000000 )
        ( -23.600000	0.500000	0.000000 )
        ( -23.550000	0.500000	0.000000 )
        ( -23.500000	0.500000	0.000000 )
        ( -23.450000	0.500000	0.000000 )
        ( -23.400000	0.500000	0.000000 )
        ( -23.350000	0.500000	0.000000 )
        ( -23.300000	0.500000	0.000000 )
        ( -23.250000	0.500000	0.000000 )
        ( -23.200000	0.500000	0.000000 )
        ( -23.150000	0.500000	0.000000 )
        ( -23.100000	0.500000	0.000000 )
        ( -23.050000	0.500000	0.000000 )
        ( -23.000000	0.500000	0.000000 )
        ( -22.950000	0.500000	0.000000 )
        ( -22.900000	0.500000	0.000000 )
        ( -22.850000	0.500000	0.000000 )
        ( -22.800000	0.500000	0.000000 )
        ( -22.750000	0.500000	0.000000 )
        ( -22.700000	0.500000	0.000000 )
        ( -22.650000	0.500000	0.000000 )
        ( -22.600000	0.500000	0.000000 )
        ( -22.550000	0.500000	0.000000 )
        ( -22.500000	0.500000	0.000000 )
        ( -22.450000	0.500000	0.000000 )
        ( -22.400000	0.500000	0.000000 )
        ( -22.350000	0.500000	0.000000 )
        ( -22.300000	0.500000	0.000000 )
        ( -22.250000	0.500000	0.000000 )
        ( -22.200000	0.500000	0.000000 )
        ( -22.150000	0.500000	0.000000 )
        ( -22.100000	0.500000	0.000000 )
        ( -22.050000	0.500000	0.000000 )
        ( -22.000000	0.500000	0.000000 )
        ( -21.950000	0.500000	0.000000 )
        ( -21.900000	0.500000	0.000000 )
        ( -21.850000	0.500000	0.000000 )
        ( -21.800000	0.500000	0.000000 )
        ( -21.750000	0.500000	0.000000 )
        ( -21.700000	0.500000	0.000000 )
        ( -21.650000	0.500000	0.000000 )
        ( -21.600000	0.500000	0.000000 )
        ( -21.550000	0.500000	0.000000 )
        ( -21.500000	0.500000	0.000000 )
        ( -21.450000	0.500000	0.000000 )
        ( -21.400000	0.500000	0.000000 )
        ( -21.350000	0.500000	0.000000 )
        ( -21.300000	0.500000	0.000000 )
        ( -21.250000	0.500000	0.000000 )
        ( -21.200000	0.500000	0.000000 )
        ( -21.150000	0.500000	0.000000 )
        ( -21.100000	0.500000	0.000000 )
        ( -21.050000	0.500000	0.000000 )
        ( -21.000000	0.500000	0.000000 )
        ( -20.950000	0.500000	0.000000 )
        ( -20.900000	0.500000	0.000000 )
        ( -20.850000	0.500000	0.000000 )
        ( -20.800000	0.500000	0.000000 )
        ( -20.750000	0.500000	0.000000 )
        ( -20.700000	0.500000	0.000000 )
        ( -20.650000	0.500000	0.000000 )
        ( -20.600000	0.500000	0.000000 )
        ( -20.550000	0.500000	0.000000 )
        ( -20.500000	0.500000	0.000000 )
        ( -20.450000	0.500000	0.000000 )
        ( -20.400000	0.500000	0.000000 )
        ( -20.350000	0.500000	0.000000 )
        ( -20.300000	0.500000	0.000000 )
        ( -20.250000	0.500000	0.000000 )
        ( -20.200000	0.500000	0.000000 )
        ( -20.150000	0.500000	0.000000 )
        ( -20.100000	0.500000	0.000000 )
        ( -20.050000	0.500000	0.000000 )
...
);

blocks
(
    hex (0  1  2  3  4  5  6  7) (100 8 11)
      simpleGrading (
        ((0.3 0.24 0.5) (0.4 0.52 1) (0.3 0.24 2))
        ((0.5 0.5 2) (0.5 0.5 0.5))
        1
      )
    hex (4  5  6  7 8 9 10 11) (100 8 256)
      simpleGrading (
        ((0.3 0.24 0.5) (0.4 0.52 1) (0.3 0.24 2))
        ((0.5 0.5 2) (0.5 0.5 0.5))
        10
      )
);

boundary
(
    outlet
    {
      type patch;
      faces
      (
        (8  9  10  11)
      );
    }

    inlet
    {
      type patch;
      faces
      (
        (0   1   2   3)
      );
    }

    walls
    {
      type wall;
      faces
      (
        ( 0   1   5   4)
        ( 4   5   9   8)
        ( 2   6   7   3)
        ( 6  10  11   7)
      );
    }

    periodicx1
    {
      type cyclic;
      neighbourPatch periodicx2;
      faces
      (
        ( 0   3   7   4)
        ( 4   7  11   8)
      );
    }

    periodicx2
    {
      type cyclic;
      neighbourPatch periodicx1;
      faces
      (
        ( 1   2   6   5)
        ( 5   6  10   9)
      );
    }

);

mergePatchPairs
(
);

// ********************************************************************* //
