cases/case1/0.org/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            danckwerts;
        value           uniform 1.0;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            nonLinear;
        value           uniform 0.0;
	Cth		0.0;
	n1		1.0;
	n2		1.0;
    }

    periodicx1
    {
        type            cyclic;
    }
    periodicx2
    {
        type            cyclic;
    }

}

// ************************************************************************* //
