cases/case1/0.org/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }

    outlet
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }

    walls
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }

    periodicx1
    {
      type            cyclic;
    }
    periodicx2
    {
      type            cyclic;
    }

}

// ************************************************************************* //
